In [1]:
import pandas as pd
import numpy as np

In [2]:
d1=pd.DataFrame({'No1':[20,-25,30,45.5],'No2':[33,33.5,-56,44]})
d2=pd.DataFrame({'No1':[10,25,40,23.5],'No2':[13,23.5,76,14]})

In [3]:
x=d1.add(d2)
y=d1.radd(d2)

In [4]:
x

    No1   No2
0  30.0  46.0
1   0.0  57.0
2  70.0  20.0
3  69.0  58.0

In [5]:
y

    No1   No2
0  30.0  46.0
1   0.0  57.0
2  70.0  20.0
3  69.0  58.0

In [6]:
x=d1.sub(d2)
y=d1.rsub(d2)

In [7]:
x

    No1    No2
0  10.0   20.0
1 -50.0   10.0
2 -10.0 -132.0
3  22.0   30.0

In [8]:
y

    No1    No2
0 -10.0  -20.0
1  50.0  -10.0
2  10.0  132.0
3 -22.0  -30.0

In [9]:
obj=pd.Series([7,-5,3,6,3,4,3])

In [10]:
obj.rank(method='min')

0    7.0
1    1.0
2    2.0
3    6.0
4    2.0
5    5.0
6    2.0
dtype: float64

# Chap 8

In [14]:
df=pd.DataFrame(np.random.randn(20).reshape(5,4))
display(df)
sampler=np.random.permutation(5)
df.take(sampler)

          0         1         2         3
0 -0.545711 -1.144968 -0.910208 -0.939510
1 -0.272634 -0.422111 -1.690161  1.063100
2 -1.023943 -0.621705  0.686601 -1.010340
3 -1.515646 -0.240980  1.221986 -0.860393
4 -1.192834 -0.208765 -0.224118  1.202460

          0         1         2         3
4 -1.192834 -0.208765 -0.224118  1.202460
2 -1.023943 -0.621705  0.686601 -1.010340
1 -0.272634 -0.422111 -1.690161  1.063100
0 -0.545711 -1.144968 -0.910208 -0.939510
3 -1.515646 -0.240980  1.221986 -0.860393

In [21]:
df.sample(frac=0.6, replace=False)

          0         1         2         3
3 -1.515646 -0.240980  1.221986 -0.860393
0 -0.545711 -1.144968 -0.910208 -0.939510
2 -1.023943 -0.621705  0.686601 -1.010340

In [27]:
df1=pd.DataFrame({'Name':['Umer','Bilal','Ali','Usman'],
                'Age':(np.random.randint(15,20,size=[4])),
                'Height':[55,66,76,58]})
df1

    Name  Age  Height
0   Umer   17      55
1  Bilal   18      66
2    Ali   19      76
3  Usman   19      58

In [29]:
df2=pd.DataFrame({'Name':['Asif','Ashraf','Sami','Fahim'],
                'Age':(np.random.randint(20,25,size=[4])),
                'Height':np.random.randint(50,70,size=[4])})
df2

     Name  Age  Height
0    Asif   21      67
1  Ashraf   22      62
2    Sami   21      64
3   Fahim   24      61

In [46]:
pd.concat([df1,df2],ignore_index=True)

     Name  Age  Height
0    Umer   17      55
1   Bilal   18      66
2     Ali   19      76
3   Usman   19      58
4    Asif   21      67
5  Ashraf   22      62
6    Sami   21      64
7   Fahim   24      61

In [57]:
pd.concat([df1,df2],ignore_index=True,sort=True)

   Age  Height    Name
0   17      55    Umer
1   18      66   Bilal
2   19      76     Ali
3   19      58   Usman
4   21      67    Asif
5   22      62  Ashraf
6   21      64    Sami
7   24      61   Fahim

In [51]:
df3=pd.DataFrame({'Name':['Umer','Bilal','Ali','Usman'],
                'Age':(np.random.randint(15,20,size=[4]))}).set_index('Name')
df3

       Age
Name
Umer    18
Bilal   18
Ali     18
Usman   15

In [52]:
df4=pd.DataFrame({'SName':['Asif','Ashraf','Sami','Fahim'],
                'Height':np.random.randint(50,70,size=[4])}).set_index('SName')
df4

        Height
SName
Asif        50
Ashraf      53
Sami        61
Fahim       59

In [61]:
pd.concat([df3,df4],ignore_index=True)

C:\Users\student\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    Age  Height
0  18.0     NaN
1  18.0     NaN
2  18.0     NaN
3  15.0     NaN
4   NaN    50.0
5   NaN    53.0
6   NaN    61.0
7   NaN    59.0

# Heirarchial Indexing

In [149]:
df=pd.Series(np.random.randint(10,20,size=[10]),
            index=[['Karachi','Karachi',
                    'Karachi','Karachi',
                    'Lahore','Lahore','Lahore',
                   'Islamabad','Peshawar','Peshawar'],
                  ['Dhoraji','Sharfabad','Tariq Road','Defence',
                  'Gulberg','Ring Road','Liberty',
                  'D-Chowk','Khyper Pass','Qissa Khuwani Bazaar']])

In [150]:
df

Karachi    Dhoraji                 18
           Sharfabad               15
           Tariq Road              12
           Defence                 12
Lahore     Gulberg                 16
           Ring Road               13
           Liberty                 13
Islamabad  D-Chowk                 18
Peshawar   Khyper Pass             12
           Qissa Khuwani Bazaar    10
dtype: int32

In [151]:
df['Karachi'].iloc[1:]

Sharfabad     15
Tariq Road    12
Defence       12
dtype: int32

In [152]:
df['Karachi'].iloc[[1,3]]

Sharfabad    15
Defence      12
dtype: int32

In [153]:
x=df.unstack()

In [154]:
x

,D-Chowk,Defence,Dhoraji,Gulberg,Khyper Pass,Liberty,Qissa Khuwani Bazaar,Ring Road,Sharfabad,Tariq Road
Islamabad,18.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Karachi,NaN,12.0,18.0,NaN,NaN,NaN,NaN,NaN,15.0,12.0
Lahore,NaN,NaN,NaN,16.0,NaN,13.0,NaN,13.0,NaN,NaN
Peshawar,NaN,NaN,NaN,NaN,12.0,NaN,10.0,NaN,NaN,NaN

In [155]:
x.stack()

Islamabad  D-Chowk                 18.0
Karachi    Defence                 12.0
           Dhoraji                 18.0
           Sharfabad               15.0
           Tariq Road              12.0
Lahore     Gulberg                 16.0
           Liberty                 13.0
           Ring Road               13.0
Peshawar   Khyper Pass             12.0
           Qissa Khuwani Bazaar    10.0
dtype: float64

In [156]:
y=pd.DataFrame(df,columns=['Code'])

In [157]:
y.index.names=['City','Area']

In [158]:
y

                                Code
City      Area
Karachi   Dhoraji                 18
          Sharfabad               15
          Tariq Road              12
          Defence                 12
Lahore    Gulberg                 16
          Ring Road               13
          Liberty                 13
Islamabad D-Chowk                 18
Peshawar  Khyper Pass             12
          Qissa Khuwani Bazaar    10

In [159]:
df[df.index.swaplevel(0,1)]

Area                  City
Dhoraji               Karachi     NaN
Sharfabad             Karachi     NaN
Tariq Road            Karachi     NaN
Defence               Karachi     NaN
Gulberg               Lahore      NaN
Ring Road             Lahore      NaN
Liberty               Lahore      NaN
D-Chowk               Islamabad   NaN
Khyper Pass           Peshawar    NaN
Qissa Khuwani Bazaar  Peshawar    NaN
dtype: float64